{"basics":{"name":"Vivaswat (Viva) Suresh","label":"Software Developer","image":"","email":"vivaswat.suresh@gmail.com","phone":"(408) 673-9610","url":"","summary":"","location":{"address":"","postalCode":"","city":"","countryCode":"","region":""},"profiles":[{"network":"","username":"","url":""}]},"work":[{"name":"@ DeepWater Exploration Inc.","position":"Founding Computer Vision Engineer","url":"https://dwe.ai","startDate":"2024-01","endDate":"Present","summary":"The next generation of subsea computer vision - the underwater vision company","highlights":["Architected DeepWater Exploration’s C++ computer vision SDK with full backend and GPU support, enabling seamless plug-and-play integration with DWE cameras and reducing customer integration time from several weeks to hours. Sold to major ROV companies.","Trained a deep learning stereo vision model on the cloud to deploy locally, using synthetic underwater data and custom CUDA/TensorRT optimizations. Achieved the fastest, most power-efficient underwater stereo system in the world with 1% error at 5 m at 30 FPS.","Engineered a CUDA-optimized Semi-Global Matching implementation with cooperative threading and aggressive CUDA optimizations, achieving 60 FPS on 8 SMs vs 1–2 FPS in OpenCV.","Designing a deep learning–based SLAM system for underwater imaging with multithreaded C++ and CUDA-accelerated 3D reconstruction. Enables real-time mapping for autonomous navigation and marine applications."," Built a deep learning–based underwater segmentation system to remove noisy background water, resolving customer issues with poor reconstructions and improving 3D vision accuracy.","Tools/Techniques: C/C++, CUDA, Python, PyTorch, ONNX, TensorRT"]},{"name":"@ FishSense UCSD","position":"Computer Vision Researcher","url":"https://e4e.ucsd.edu/fishsense","startDate":"2021-01","endDate":"2024-01","summary":"FishSense is a research project that is focused on leveraging underwater cameras and computer vision techniques to monitor fish population health. The project's goal is to autonomously detect and measure the lengths of fish in their home environments, with minimally invasive techniques.","highlights":["Modeled parallax between laser and camera and trained a convolutional neural network to automatically detect laser in image RAWs. Achieved 98% accuracy in laser detection.","Developed a program to synchronize two GoPro videos based on an impulse noise using time series analysis techniques to create a stereo camera.","Implemented a non-machine learning approach to fish species identification using the Eigenface algorithm to measure fish population health.","Gathered data and trained a YOLOv4 Object Detection network for the sake of autonomous fish tracking.","Created and developed a depth-based segmentation algorithm to segment fish within a bounding box using data from a commercial stereo camera.","Tools/Techniques: Rust, Python, PyTorch, Tensorflow 2.0, Keras, Matrix Profiles, Stumpy, C/C++"]},{"name":"@ Applied Materials","position":"Data Science Intern","url":"https://www.appliedmaterials.com/","startDate":"2022-06","endDate":"2022-12","summary":"Worked in Applied Materials R&D. Analyzed decades of data collected from various semiconductor manufacturing machines using various ML techniques.","highlights":["Conducted an expansive scientific literature review on cutting edge time series analysis techniques to discover viable techniques for data analysis.","Leveraged unsupervised learning techniques on semiconductor wafer data in order to detect discords and motifs within expansive datasets","Implemented a fast similarity search algorithm to quickly comb through decades of data to find similar subsequences to trace anomalies through time.","Tools/Techniques: Python, Stumpy, Matrix Profiles, FFT, DFT"]}],"volunteer":[],"education":[{"institution":"University of California, San Diego","url":"https://cse.ucsd.edu/","studyType":"BS Computer Science, Mathematics","courses":[]}],"awards":[],"certificates":[],"publications":[],"skills":[],"languages":[{"language":"English","fluency":"Fluent"}],"interests":[],"references":[],"projects":[]}