{"basics":{"name":"Vivaswat (Viva) Suresh","label":"Software Developer","image":"","email":"vivaswat.suresh@gmail.com","phone":"(408) 673-9610","url":"","summary":"","location":{"address":"","postalCode":"","city":"","countryCode":"","region":""},"profiles":[{"network":"","username":"","url":""}]},"work":[{"name":"@ FishSense UCSD","position":"Computer Vision Researcher","url":"https://e4e.ucsd.edu/fishsense","startDate":"1-2021","endDate":"now","summary":"FishSense is a research project that is focused on leveraging underwater cameras and computer vision techniques to monitor fish population health. The project's goal is to autonomously detect and measure the lengths of fish in their home environments, with minimally invasive techniques.","highlights":["Currently developing a Rust pipeline for novel laser-assisted underwater fish length measurement. Previously developed a Python pipeline for the same purpose.","Modeled parallax between laser and camera and trained a convolutional neural network to automatically detect laser in image RAWs. Achieved 98% accuracy in laser detection.","Developed a program to synchronize two GoPro videos based on an impulse noise using time series analysis techniques to create a stereo camera.","Implemented a non-machine learning approach to fish species identification using the Eigenface algorithm to measure fish population health.","Gathered data and trained a YOLOv4 Object Detection network for the sake of autonomous fish tracking.","Created and developed a depth-based segmentation algorithm to segment fish within a bounding box using data from a commercial stereo camera.","Tools/Techniques: Rust, Python, PyTorch, Tensorflow 2.0, Keras, Matrix Profiles, Stumpy, C/C++"]},{"name":"@ Applied Materials","position":"Data Science Intern","url":"https://www.appliedmaterials.com/","startDate":"6-2022","endDate":"12-2022","summary":"Worked in Applied Materials R&D. Analyzed decades of data collected from various semiconductor manufacturing machines using various ML techniques.","highlights":["Conducted an expansive scientific literature review on cutting edge time series analysis techniques to discover viable techniques for data analysis.","Leveraged unsupervised learning techniques on semiconductor wafer data in order to detect discords and motifs within expansive datasets","Implemented a fast similarity search algorithm to quickly comb through decades of data to find similar subsequences to trace anomalies through time.","Tools/Techniques: Python, Stumpy, Matrix Profiles, FFT, DFT"]},{"name":"@ Argovis","position":"Software Engineer","url":"argovis.colorado.edu","startDate":"2-2021","endDate":"2-2022","summary":"Argovis is a web application that is used to search for, download, and visualize ocean data from thousands of robotic floats around the ocean.","highlights":["Created UI changes for oceanographers to better model data on argovis servers.","Leveraged modern Python libraries to upgrade outdated algorithm for storing data in MongoDB documents for ease of developer understanding and future development.","Tools/Techniques: Typescript, Angular, Docker, Docker Compose, Bash, MongoDB"]}],"volunteer":[],"education":[{"institution":"University of California, San Diego","url":"https://cse.ucsd.edu/","area":"GPA: 3.6","studyType":"BS Computer Science, Mathematics","startDate":"9-2020","endDate":"12-2023","score":"3.6","courses":[]}],"awards":[],"certificates":[],"publications":[],"skills":[],"languages":[{"language":"English","fluency":"Fluent"}],"interests":[],"references":[],"projects":[]}